# Parameters
nc: 4 # number of classes
scales:
  small: [0.33, 0.25, 1024] # UWNet summary: 480 layers,  6676396 parameters,  6676380 gradients,   21.3 GFLOPs
  
# UWNet backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, SPDConv, [128]]  # 1-P2/4
  - [-1, 3, VSSBlock_YOLO, [128]]
  - [-1, 1, SPDConv, [256]]  # 1-P2/4
  - [-1, 6, VSSBlock_YOLO, [256]]
  - [-1, 1, SPDConv, [512]]  # 1-P2/4
  - [-1, 6, VSSBlock_YOLO, [512]]
  - [-1, 1, SPDConv, [1024]]  # 1-P2/4
  - [-1, 3, VSSBlock_YOLO, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# UWNet Neck
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4 40*40
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3 80*80
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3 160*160  
  - [-1, 3, C2f, [128]]  # 18 (P3/8-small)
  - [-1, 1, MSFF, [128,3,5,7]]  # 10

  - [-1, 1, SPDConv, [256]]
  - [[-1, 4], 1, Concat, [1]]  # cat head P4 80*80
  - [-1, 3, C2f, [256]]  # 21 (P4/16-medium)
  - [-1, 1, MSFF, [256,3,5,7]]  # 10

  - [-1, 1, SPDConv, [256]]
  - [[-1, 6], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 24 (P4/16-medium)
  - [-1, 1, MSFF, [512,3,5,9]]  # 10

  - [-1, 1, SPDConv, [512]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 27 (P5/32-large)
  - [-1, 1, MSFF, [1024,5,9,11]]  # 10

  - [[19, 23, 27, 31], 1, Detect, [nc]]  # Detect(P3, P4, P5)